app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
	def index
		render json: Company.all

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 1]]
---
	def find_company
		@company = Company.find(params[:id])