app/controllers/positions_controller.rb

	def index
	  render json: Position.all
---
SELECT "positions".* FROM "positions"