app/controllers/vacancies_controller.rb

SELECT "vacancies".* FROM "vacancies"
---
	def index
		render json: Vacancy.all